#pragma once

#include "global.h"
#include "types.h"

class UnkStruct_020ee698 {
public:
    /* 00 */ unk8 mUnk_00;
    /* 01 */ unk8 mUnk_01;
    /* 02 */ unk16 mUnk_02;
    /* 04 */ u16 mUnk_04;
    /* 04 */ unk16 mUnk_06;
    /* 08 */ unk32 mUnk_08;
    /* 0c */ u16 *mUnk_0c;
    /* 10 */ unk8 mUnk_10[0x1C];
    /* 2c */ unk32 mUnk_2c;
    /* 30 */

    UnkStruct_020ee698();
};

extern UnkStruct_020ee698 data_ov000_020ee698;
